# code --list-extensions > extensions.txt

42Crunch.vscode-openapi
astro-build.astro-vscode
be5invis.toml
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
esbenp.prettier-vscode
eseom.nunjucks-template
GitHub.codespaces
github.vscode-github-actions
GitHub.vscode-pull-request-github
golang.go
JacobPfeifer.pfeifer-hurl
jkjustjoshing.vscode-text-pastry
liviuschera.noctis
mikestead.dotenv
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-vscode.sublime-keybindings
ms-vsliveshare.vsliveshare
PKief.material-icon-theme
redhat.vscode-yaml
remcohaszing.schemastore
sleistner.vscode-fileutils
stylelint.vscode-stylelint
teabyii.ayu
timonwong.shellcheck
tlent.jest-snapshot-language-support
unifiedjs.vscode-mdx
vsls-contrib.codetour
wix.vscode-import-cost
yoavbls.pretty-ts-errors
ziyasal.vscode-open-in-github
