# code --list-extensions > .vscode/extensions.txt

42crunch.vscode-openapi
astro-build.astro-vscode
be5invis.toml
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
bradlc.vscode-tailwindcss
charliermarsh.ruff
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
hashicorp.terraform
jacobpfeifer.pfeifer-hurl
jkjustjoshing.vscode-text-pastry
mattpocock.ts-error-translator
mechatroner.rainbow-csv
mikestead.dotenv
mongodb.mongodb-vscode
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.sublime-keybindings
ms-vsliveshare.vsliveshare
pkief.material-icon-theme
redhat.vscode-yaml
remcohaszing.schemastore
sleistner.vscode-fileutils
stylelint.vscode-stylelint
sysoev.vscode-open-in-github
tamasfe.even-better-toml
teabyii.ayu
timonwong.shellcheck
tlent.jest-snapshot-language-support
unifiedjs.vscode-mdx
vsls-contrib.codetour
yoavbls.pretty-ts-errors
ziyasal.vscode-open-in-github
